In [12]:
import pandas as pd
import numpy as np

In [16]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
student_data.head()

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2

Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object

In [6]:
one=student_data.groupby(["school_code"])
for name in one:
    print(name)

('s001',    school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1  )
('s002',    school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2  )
('s003',    school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3)
('s004',    school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4  )

2. Write a Pandas program to split the following given dataframe by school code and get mean, min, and max value of age for each school

In [14]:
two=student_data.groupby(["school_code"]).agg({'age': ['mean', 'min', 'max']})
print(two)

              age
             mean min max
school_code
s001         12.5  12  13
s002         13.0  12  14
s003         13.0  13  13
s004         12.0  12  12

Write a Pandas program to split the following given dataframe into groups based on school code and class

In [17]:
three=student_data.groupby(['school_code', 'class'])
for name,group in three:
    print(name)
    print(group)

('s001', 'V')
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35

    address
S1  street1
('s001', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S4        s001    VI  Eesha Hinton     25/09/1998   13     167      30

    address
S4  street1
('s002', 'V')
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2
('s003', 'VI')
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3
('s004', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

### Write a Pandas program to split the following given dataframe into groups based on school code and cast grouping as a list

In [18]:
four=student_data.groupby(["school_code"])
print(list(four))

[('s001',    school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1  ), ('s002',    school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2  ), ('s003',    school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3), ('s004',    school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4  )]

### Write a Pandas program to split the following given dataframe into groups based on single column and multiple columns. Find the size of the grouped data

In [19]:
print(four.size())
print(three.size())

school_code
s001    2
s002    2
s003    1
s004    1
dtype: int64
school_code  class
s001         V        1
             VI       1
s002         V        2
s003         VI       1
s004         VI       1
dtype: int64

### Write a Pandas program to split the following given dataframe into groups based on school code and call a specific group with the name of the group

In [5]:
five=student_data.groupby(["class"])
print(five.get_group('VI'))

   school_code class          name date_Of_Birth   age  height  weight  \
S3        s003    VI   Ryan Parkes     16/02/1999   13     186      33
S4        s001    VI  Eesha Hinton     25/09/1998   13     167      30
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S3  street3
S4  street1
S6  street4

In [2]:
orders_data = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
print(orders_data)

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001

### Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group. Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id)

In [21]:
one=orders_data.groupby(['customer_id']).agg({'purch_amt':['mean', 'min', 'max']})
print(one)

               purch_amt
                    mean      min      max
customer_id
3001          270.650000   270.65   270.65
3002         2956.953333    65.26  5760.00
3003           75.290000    75.29    75.29
3004         1983.430000  1983.43  1983.43
3005          549.500000   150.50   948.50
3007         2400.600000  2400.60  2400.60
3008          250.450000   250.45   250.45
3009         1295.450000   110.50  2480.40

### Write a Pandas program to split a dataset to group by two columns and count by each row

In [32]:
two=orders_data.groupby(['customer_id','ord_date']).size()
print(two)

customer_id  ord_date
3001         2012-09-10    1
3002         2012-04-25    1
             2012-09-10    1
             2012-10-05    1
3003         2012-08-17    1
3004         2012-10-10    1
3005         2012-09-10    1
             2012-10-05    1
3007         2012-07-27    1
3008         2012-06-27    1
3009         2012-08-17    1
             2012-10-10    1
dtype: int64

In [44]:
## three=orders_data.groupby(['customer_id','salesman_id']).size().reset_index().groupby(['customer_id','salesman_id'])[[0]].sum()
 
three=orders_data.groupby(['customer_id','salesman_id']).size().reset_index().groupby(['customer_id','salesman_id'])[[0]].max()
print(three)

                         0
customer_id salesman_id
3001        5005         1
3002        5001         3
3003        5007         1
3004        5006         1
3005        5002         2
3007        5001         1
3008        5002         1
3009        5003         2

### Write a Pandas program to split a dataset to group by two columns and then sort the aggregated results within the groups

In [66]:
four=orders_data.groupby(['customer_id','salesman_id']).agg({'purch_amt':sum}).sort_values(by='purch_amt', ascending=False)
print(four)

five=orders_data.groupby(['customer_id','salesman_id']).agg({'purch_amt':sum}).nlargest(n=10,columns='purch_amt' )
print(five)

                         purch_amt
customer_id salesman_id
3002        5001           8870.86
3009        5003           2590.90
3007        5001           2400.60
3004        5006           1983.43
3005        5002           1099.00
3001        5005            270.65
3008        5002            250.45
3003        5007             75.29
                         purch_amt
customer_id salesman_id
3002        5001           8870.86
3009        5003           2590.90
3007        5001           2400.60
3004        5006           1983.43
3005        5002           1099.00
3001        5005            270.65
3008        5002            250.45
3003        5007             75.29

In [10]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2012','08-17-2012','10-09-2012','07-27-2012','10-09-2012','10-10-2012','10-10-2012','06-17-2012','07-08-2012','04-25-2012'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
print(df)

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  05-10-2012         3001         5002
1    70009     270.65  09-10-2012         3001         5005
2    70002      65.26  05-10-2012         3005         5001
3    70004     110.50  08-17-2012         3001         5003
4    70007     948.50  10-09-2012         3005         5002
5    70005    2400.60  07-27-2012         3001         5001
6    70008    5760.00  10-09-2012         3005         5001
7    70010    1983.43  10-10-2012         3001         5006
8    70003    2480.40  10-10-2012         3005         5003
9    70012     250.45  06-17-2012         3001         5002
10   70011      75.29  07-08-2012         3005         5007
11   70013    3045.60  04-25-2012         3005         5001

### Write a Pandas program to split the following dataframe into groups and calculate monthly purchase amount

In [17]:
df.info()
df['ord_date']= pd.to_datetime(df['ord_date']) 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ord_no       12 non-null     int64
 1   purch_amt    12 non-null     float64
 2   ord_date     12 non-null     object
 3   customer_id  12 non-null     int64
 4   salesman_id  12 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 608.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ord_no       12 non-null     int64
 1   purch_amt    12 non-null     float64
 2   ord_date     12 non-null     datetime64[ns]
 3   customer_id  12 non-null     int64
 4   salesman_id  12 non-null     int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 608.0 bytes

In [8]:
six=df.set_index('ord_date').groupby(pd.Grouper(freq='M')).agg({'purch_amt':sum})
print(six)

            purch_amt
ord_date
2012-04-30    3045.60
2012-05-31     215.76
2012-06-30     250.45
2012-07-31    2475.89
2012-08-31     110.50
2012-09-30     270.65
2012-10-31   11172.33

In [5]:
seven=df.groupby('ord_date').agg({'purch_amt':sum})
print(seven)

### This does not function to sum it up by month , only groups by date

            purch_amt
ord_date
2012-04-25    3045.60
2012-05-10     215.76
2012-06-17     250.45
2012-07-08      75.29
2012-07-27    2400.60
2012-08-17     110.50
2012-09-10     270.65
2012-10-09    6708.50
2012-10-10    4463.83

### Write a Pandas program to split the following dataframe into groups, group by month and year based on order date and find the total purchase amount year wise, month wise

In [19]:
eight= df.groupby([df['ord_date'].dt.year,df['ord_date'].dt.month]).agg({'purch_amt':sum})
print(eight)

                   purch_amt
ord_date ord_date
2012     4           3045.60
         5            215.76
         6            250.45
         7           2475.89
         8            110.50
         9            270.65
         10         11172.33